In [2]:
import pandas as pd

In [6]:
df = pd.read_excel("invasive.xlsx")
df.head()

,name,country,kingdom,system,origin,impact,authority
0,Acabaria erythraea,Israel,Animalia,marine,Alien,Yes,"(Ehrenberg, 1834)"
1,Acar plicata,Israel,Animalia,marine,Alien,Yes,"(Dillwyn, 1817)"
2,Acartia tonsa,Spain,Animalia,marine,Alien,Yes,"Dana, 1849"
3,Acrothamnion preissii,Spain,Plantae,marine,Alien,Yes,E.M.Wollaston (Sonder)
4,Alepes djedaba,Israel,Animalia,marine,Alien,Yes,"(Forsskål, 1775)"

In [12]:
df.groupby('country')['name'].count()

country
Albania      1
Croatia     27
Cyprus      12
France      13
Greece       3
Israel      64
Malta       11
Slovenia     1
Spain       13
Tunisia     22
Turkey      30
Name: name, dtype: int64